{"vocab_size": 1024, "stop_word": "</w>", "merges": {"e,</w>": "e</w>", "t,h": "th", "t,</w>": "t</w>", "s,</w>": "s</w>", "d,</w>": "d</w>", ".,</w>": ".</w>", "y,</w>": "y</w>", "e,r": "er", "a,n": "an", "i,n": "in", "o,r": "or", "a,r": "ar", "o,</w>": "o</w>", "th,e</w>": "the</w>", "an,d</w>": "and</w>", "I,</w>": "I</w>", "th,e": "the", "s,h": "sh", "o,n": "on", "a,l": "al", ",,</w>": ",</w>", "o,u": "ou", "r,e": "re", "f,or": "for", "a,</w>": "a</w>", "sh,o": "sho", "o,m": "om", "in,g": "ing", "e,n": "en", "er,</w>": "er</w>", "t,o</w>": "to</w>", "ing,</w>": "ing</w>", "e,s</w>": "es</w>", "i,s</w>": "is</w>", "e,d</w>": "ed</w>", "f,</w>": "f</w>", "s,e</w>": "se</w>", "T,h": "Th", "h,a": "ha", "o,o": "oo", "v,e</w>": "ve</w>", "w,i": "wi", "s,t": "st", "l,i": "li", "a,b": "ab", "l,</w>": "l</w>", "l,e</w>": "le</w>", "l,y</w>": "ly</w>", "c,om": "com", "a,t</w>": "at</w>", "s,i": "si", "m,</w>": "m</w>", "e,.</w>": "e.</w>", "w,e": "we", "o,f</w>": "of</w>", "for,</w>": "for</w>", "g,h": "gh", "in,</w>": "in</w>", "f,e": "fe", "ar,e</w>": "are</w>", "a,s</w>": "as</w>", "t,i": "ti", "b,u": "bu", "i,t</w>": "it</w>", "k,</w>": "k</w>", "e,s": "es", "on,</w>": "on</w>", "for,t": "fort", "v,er": "ver", "i,t": "it", "m,y</w>": "my</w>", "c,h": "ch", "th,</w>": "th</w>", "s,u": "su", "sho,es</w>": "shoes</w>", "the,y</w>": "they</w>", "i,r": "ir", "fort,ab": "fortab", "a,t": "at", "o,w": "ow", "e,a": "ea", "com,fortab": "comfortab", "the,se</w>": "these</w>", "s,t</w>": "st</w>", "a,c": "ac", "bu,t</w>": "but</w>", "an,</w>": "an</w>", "Th,e": "The", "ha,ve</w>": "have</w>", "!,</w>": "!</w>", "si,z": "siz", "i,c": "ic", "p,p": "pp", "o,t</w>": "ot</w>", "we,ar": "wear", "o,l": "ol", "p,a": "pa", "wi,th</w>": "with</w>", "the,m</w>": "them</w>", "l,oo": "loo", "b,e": "be", "en,</w>": "en</w>", "l,l</w>": "ll</w>", "sho,e</w>": "shoe</w>", "fe,e": "fee", "t,o": "to", "n,</w>": "n</w>", "u,r": "ur", "th,at</w>": "that</w>", "s,o</w>": "so</w>", "Th,e</w>": "The</w>", "e,,</w>": "e,</w>", "p,</w>": "p</w>", "w,h": "wh", "k,e</w>": "ke</w>", "s,.</w>": "s.</w>", "gh,t</w>": "ght</w>", "d,i": "di", "w,as</w>": "was</w>", "ver,y</w>": "very</w>", "g,re": "gre", "pa,ir": "pair", "r,i": "ri", "comfortab,le</w>": "comfortable</w>", "t,.</w>": "t.</w>", "l,o": "lo", "siz,e</w>": "size</w>", "al,ly</w>": "ally</w>", "y,ou": "you", "al,</w>": "al</w>", "d,e</w>": "de</w>", "n,ot</w>": "not</w>", "or,</w>": "or</w>", "ch,</w>": "ch</w>", "t,t": "tt", "s,e": "se", "n,e": "ne", "ou,l": "oul", "er,e</w>": "ere</w>", "ou,t</w>": "out</w>", "w,or": "wor", "r,o": "ro", "th,is</w>": "this</w>", "m,e</w>": "me</w>", "c,a": "ca", "wear,</w>": "wear</w>", "d,a": "da", "m,a": "ma", "b,e</w>": "be</w>", "f,it</w>": "fit</w>", "li,ke</w>": "like</w>", "th,er</w>": "ther</w>", "ow,</w>": "ow</w>", "e,x": "ex", "r,u": "ru", "sho,es": "shoes", "s,o": "so", "p,er": "per", "d,e": "de", "',t</w>": "'t</w>", "The,y</w>": "They</w>", "oul,d</w>": "ould</w>", "I,'": "I'", "l,e": "le", "k,ing</w>": "king</w>", "st,y": "sty", "d,.</w>": "d.</w>", "al,l</w>": "all</w>", "pair,</w>": "pair</w>", "y,.</w>": "y.</w>", "s,a": "sa", "q,u": "qu", "l,ac": "lac", "l,a": "la", "The,se</w>": "These</w>", "m,en": "men", "gre,at</w>": "great</w>", "m,o": "mo", "b,o": "bo", "l,e.</w>": "le.</w>", "',s</w>": "'s</w>", "e,l": "el", "s,n": "sn", "u,n": "un", "fe,c": "fec", "g,e": "ge", "you,</w>": "you</w>", "oo,d</w>": "ood</w>", "d,er": "der", "k,s</w>": "ks</w>", "u,st</w>": "ust</w>", "or,e</w>": "ore</w>", "w,al": "wal", "to,o</w>": "too</w>", "w,a": "wa", "th,an</w>": "than</w>", "om,</w>": "om</w>", "loo,k</w>": "look</w>", "on,g": "ong", "w,ere</w>": "were</w>", "f,f": "ff", "the,m": "them", "t,r": "tr", "c,on": "con", "su,pp": "supp", "h,i": "hi", "w,</w>": "w</w>", "gh,</w>": "gh</w>", "ea,k": "eak", "u,se</w>": "use</w>", "p,e": "pe", "f,oo": "foo", "f,r": "fr", "e,ar": "ear", "e,ly</w>": "ely</w>", "al,l": "all", "v,er</w>": "ver</w>", "en,t</w>": "ent</w>", "c,u": "cu", "supp,or": "suppor", "re,a": "rea", "o,ther</w>": "other</w>", "s,,</w>": "s,</w>", "ha,d</w>": "had</w>", "f,in": "fin", "c,ol": "col", "s,li": "sli", "per,fec": "perfec", "j,ust</w>": "just</w>", "s,ed</w>": "sed</w>", "m,ore</w>": "more</w>", "shoes,.</w>": "shoes.</w>", "fee,t</w>": "feet</w>", "w,ould</w>": "would</w>", "v,i": "vi", "on,e</w>": "one</w>", "ou,ght</w>": "ought</w>", "lo,ve</w>": "love</w>", "sn,eak": "sneak", "ic,e</w>": "ice</w>", "r,e</w>": "re</w>", "ou,n": "oun", ".,.": "..", "er,s</w>": "ers</w>", "er,y</w>": "ery</w>", "wi,d": "wid", "g,ood</w>": "good</w>", "l,ea": "lea", "s,om": "som", "t,,</w>": "t,</w>", "p,ro": "pro", "k,e": "ke", "t,er</w>": "ter</w>", "s,ol": "sol", "wi,de</w>": "wide</w>", "sho,e.</w>": "shoe.</w>", "l,ar": "lar", "u,p</w>": "up</w>", "V,ery</w>": "Very</w>", "ge,t</w>": "get</w>", "c,e</w>": "ce</w>", "5,</w>": "5</w>", "G,re": "Gre", "fr,om</w>": "from</w>", "t,ur": "tur", "y,,</w>": "y,</w>", "Gre,at</w>": "Great</w>", "ing,.</w>": "ing.</w>", "f,it": "fit", "da,y</w>": "day</w>", "l,e,</w>": "le,</w>", "or,der": "order", "ar,r": "arr", "s,m": "sm", "wi,ll</w>": "will</w>", "a,g": "ag", "wh,i": "whi", "comfortab,le.</w>": "comfortable.</w>", "al,it": "alit", "I',m</w>": "I'm</w>", "h,o": "ho", "2,</w>": "2</w>", "t,s</w>": "ts</w>", "them,.</w>": "them.</w>", "i,g": "ig", "y,s</w>": "ys</w>", "mo,st</w>": "most</w>", "M,y</w>": "My</w>", "er,.</w>": "er.</w>", "u,s": "us", "re,ally</w>": "really</w>", "c,an</w>": "can</w>", "ca,use</w>": "cause</w>", "n,arr": "narr", "y,ear": "year", "qu,alit": "qualit", "ou,gh</w>": "ough</w>", "Th,is</w>": "This</w>", "d,s</w>": "ds</w>", "r,</w>": "r</w>", "p,re": "pre", "gre,at": "great", "t,ed</w>": "ted</w>", "fee,l</w>": "feel</w>", "m,i": "mi", "st,i": "sti", "a,m</w>": "am</w>", "com,p": "comp", "u,t</w>": "ut</w>", "c,ha": "cha", "ha,s</w>": "has</w>", "p,ur": "pur", "h,e": "he", "loo,king</w>": "looking</w>", "sh,</w>": "sh</w>", "l,ong": "long", "f,ter</w>": "fter</w>", "t,a": "ta", "wh,en</w>": "when</w>", "1,0": "10", "i,f</w>": "if</w>", "d,o": "do", "f,ir": "fir", "li,tt": "litt", "ab,out</w>": "about</w>", "m,u": "mu", "be,cause</w>": "because</w>", "u,e</w>": "ue</w>", "p,er</w>": "per</w>", "ow,n</w>": "own</w>", "a,pp": "app", "d,on": "don", "it,e</w>": "ite</w>", "p,r": "pr", "oun,d</w>": "ound</w>", "litt,le</w>": "little</w>", "so,le</w>": "sole</w>", "b,ought</w>": "bought</w>", "l,l": "ll", "pur,cha": "purcha", "ti,on": "tion", "d,,</w>": "d,</w>", "t,e": "te", "es,.</w>": "es.</w>", "I',ve</w>": "I've</w>", "order,ed</w>": "ordered</w>", "t,ly</w>": "tly</w>", "n,o</w>": "no</w>", "su,al</w>": "sual</w>", "b,ig": "big", "b,r": "br", "wear,ing</w>": "wearing</w>", "com,men": "commen", "be,en</w>": "been</w>", "f,u": "fu", "pe,c": "pec", "m,e": "me", "d,er</w>": "der</w>", "f,a": "fa", "),</w>": ")</w>", "d,ed</w>": "ded</w>", "re,tur": "retur", "sty,le</w>": "style</w>", "an,y</w>": "any</w>", ".,5</w>": ".5</w>", "L,o": "Lo", "foo,t</w>": "foot</w>", "ab,le</w>": "able</w>", "whi,ch</w>": "which</w>", "-,</w>": "-</w>", "bo,x": "box", "ti,c": "tic", "e,v": "ev", "',re</w>": "'re</w>", "d,n": "dn", "we,ll</w>": "well</w>", "at,er": "ater", "som,e</w>": "some</w>", "ti,on</w>": "tion</w>", "th,ing</w>": "thing</w>", "d,o</w>": "do</w>", "h,e</w>": "he</w>", "p,o": "po", "m,on": "mon", "e,ver": "ever", "b,ac": "bac", "l,t</w>": "lt</w>", "suppor,t</w>": "support</w>", "ar,ch</w>": "arch</w>", "sh,i": "shi", "fir,st</w>": "first</w>", "r,a": "ra", "re,c": "rec", "g,o": "go", "k,.</w>": "k.</w>", "d,ing</w>": "ding</w>", "re,commen": "recommen", "k,ed</w>": "ked</w>", "es,s</w>": "ess</w>", "n,ow</w>": "now</w>", "a,fter</w>": "after</w>", "v,ed</w>": "ved</w>", "o,p": "op", "di,ff": "diff", "s,y</w>": "sy</w>", "e,p": "ep", "t,ru": "tru", "ca,sual</w>": "casual</w>", "lar,g": "larg", "col,or": "color", "b,it</w>": "bit</w>", "narr,ow</w>": "narrow</w>", "qualit,y</w>": "quality</w>", "s,e.</w>": "se.</w>", "on,ly</w>": "only</w>", "at,e</w>": "ate</w>", "to,e</w>": "toe</w>", "you,r</w>": "your</w>", "ri,ght</w>": "right</w>", "ti,me</w>": "time</w>", "Lo,ve</w>": "Love</w>", "sli,p</w>": "slip</w>", "g,ot</w>": "got</w>", "b,rea": "brea", "don,'t</w>": "don't</w>", "h,al": "hal", "f,f</w>": "ff</w>", "g,o</w>": "go</w>", "H,e</w>": "He</w>", "sty,li": "styli", "I,t</w>": "It</w>", "p,ar": "par", "n,o": "no", "e,l</w>": "el</w>", "w,ha": "wha", "ever,y": "every", "be,tt": "bett", "or,m": "orm", "a,d": "ad", "bu,y</w>": "buy</w>", "mu,ch</w>": "much</w>", "1,1": "11", "sti,ll</w>": "still</w>", "o,ff": "off", "so,c": "soc", "s,k": "sk", "y,'re</w>": "y're</w>", "sm,all": "small", "wor,k</w>": "work</w>", "wor,n</w>": "worn</w>", "u,c": "uc", "wa,y</w>": "way</w>", "us,b": "usb", "es,t</w>": "est</w>", "wal,king</w>": "walking</w>", "I,\u2019": "I\u2019", "!,!</w>": "!!</w>", "long,</w>": "long</w>", "hal,f</w>": "half</w>", "ar,</w>": "ar</w>", "perfec,t</w>": "perfect</w>", "\u2019,t</w>": "\u2019t</w>", "siz,e.</w>": "size.</w>", "n,ice</w>": "nice</w>", "n,orm": "norm", "ar,d</w>": "ard</w>", "ev,en</w>": "even</w>", "an,s</w>": "ans</w>", "m,e.</w>": "me.</w>", "fee,l": "feel", "bac,k</w>": "back</w>", "ic,</w>": "ic</w>", "tru,e</w>": "true</w>", "diff,er": "differ", "g,i": "gi", "e,i": "ei", "ater,i": "ateri", "w,an": "wan", "comfortab,le,</w>": "comfortable,</w>", "h,usb": "husb", "col,or</w>": "color</w>", "se,e": "see", "wha,t</w>": "what</w>", "b,lac": "blac", "\",</w>": "\"</w>", "p,ut</w>": "put</w>", "dn,'t</w>": "dn't</w>", "si,g": "sig", "al,so</w>": "also</w>", "\u2019,s</w>": "\u2019s</w>", "lea,ther</w>": "leather</w>", "y,ing</w>": "ying</w>", "great,.</w>": "great.</w>", "ar,ound</w>": "around</w>", "k,es</w>": "kes</w>", "C,om": "Com", "an,other</w>": "another</w>", "t,ri": "tri", "for,t</w>": "fort</w>", "ol,d</w>": "old</w>", "m,ateri": "materi", "app,o": "appo", "ha,pp": "happ", "i,m": "im", "c,an": "can", "in,.</w>": "in.</w>", "wi,th": "with", "el,l": "ell", "t,u": "tu", "h,ow</w>": "how</w>", "an,d": "and", "th,er": "ther", "Z,appo": "Zappo", "v,es</w>": "ves</w>", "su,per</w>": "super</w>", "fe,lt</w>": "felt</w>", "l,u": "lu", "t,er": "ter", "we,ll": "well", "si,de</w>": "side</w>", "ne,w</w>": "new</w>", "f,t</w>": "ft</w>", "3,</w>": "3</w>", "n,ed</w>": "ned</w>", "ex,c": "exc", "shoes,,</w>": "shoes,</w>", "on,.</w>": "on.</w>", "t,oo": "too", "s,si": "ssi", "s,s</w>": "ss</w>", "t,e</w>": "te</w>", "e,ver</w>": "ever</w>", "we,e": "wee", "sol,es</w>": "soles</w>", "sneak,ers</w>": "sneakers</w>", "h,is</w>": "his</w>", "an,g": "ang", "s,in": "sin", "fee,t.</w>": "feet.</w>", "s,er": "ser", "sho,e,</w>": "shoe,</w>", "ea,sy</w>": "easy</w>", "i,s": "is", "pair,s</w>": "pairs</w>", "gh,t": "ght", "bett,er</w>": "better</w>", "recommen,d</w>": "recommend</w>", "an,y": "any", "ma,de</w>": "made</w>", "differ,ent</w>": "different</w>", "com,fort</w>": "comfort</w>", "sa,me</w>": "same</w>", "g,u": "gu", "i,</w>": "i</w>", "ag,a": "aga", "husb,and</w>": "husband</w>", "box,</w>": "box</w>", "pro,b": "prob", "mon,th": "month", "w,om": "wom", "ex,pec": "expec", "ir,</w>": "ir</w>", "t,re": "tre", "wal,k</w>": "walk</w>", "vi,e": "vie", "E,</w>": "E</w>", "i,l": "il", "th,o": "tho", "de,sig": "desig", "wa,ys</w>": "ways</w>", "wid,th</w>": "width</w>", "ru,n</w>": "run</w>", "h,ou": "hou", "lac,es</w>": "laces</w>", "ne,e": "nee", "u,p": "up", "b,y</w>": "by</w>", "d,y</w>": "dy</w>", "or,der</w>": "order</w>", "it,'s</w>": "it's</w>", "la,st</w>": "last</w>", "t,y": "ty", "S,o</w>": "So</w>", "S,</w>": "S</w>", "blac,k</w>": "black</w>", "ne,ed</w>": "need</w>", "n,.</w>": "n.</w>", "b,a": "ba", "ou,t": "out", "c,ould</w>": "could</w>", "som,e": "some", "p,ic": "pic", "hi,gh</w>": "high</w>", "re,vie": "revie", "we,i": "wei", "s,p": "sp", "en,d</w>": "end</w>", "d,own</w>": "down</w>", "li,ght</w>": "light</w>", "fin,d</w>": "find</w>", "e,p</w>": "ep</w>", "th,ere</w>": "there</w>", "loo,ks</w>": "looks</w>", "R,e": "Re", "o,ver</w>": "over</w>", "he,el</w>": "heel</w>", "S,ke": "Ske", "d,re": "dre", "v,ing</w>": "ving</w>", "I,f</w>": "If</w>", "W,i": "Wi", "t,l": "tl", "st,ar": "star", "),.</w>": ").</w>", "ma,ke</w>": "make</w>", "t,ong": "tong", "cu,shi": "cushi", "g,oo": "goo", "wor,e</w>": "wore</w>", "en,ough</w>": "enough</w>", "s,on</w>": "son</w>", "es,,</w>": "es,</w>", "1,/": "1/", "o,ff</w>": "off</w>", "purcha,sed</w>": "purchased</w>", "an,k": "ank", "w,o</w>": "wo</w>", "th,in": "thin", "p,lac": "plac", "with,out</w>": "without</w>", "retur,n</w>": "return</w>", "ou,gh": "ough", "S,u": "Su", "ru,n": "run", "ing,,</w>": "ing,</w>", "di,d</w>": "did</w>", "al,ways</w>": "always</w>", "A,l": "Al", "S,ho": "Sho", "su,r": "sur", "fin,it": "finit", "finit,ely</w>": "finitely</w>", "..,.</w>": "...</w>", "wal,k": "walk", "fe,w</w>": "few</w>", "year,s</w>": "years</w>", "suppor,t.</w>": "support.</w>", "sho,e": "shoe", "f,l": "fl", "n,ing</w>": "ning</w>", "A,n": "An", "ma,z": "maz", "e,d.</w>": "ed.</w>", "G,ood</w>": "Good</w>", "N,ot</w>": "Not</w>", "wh,ite</w>": "white</w>", "H,a": "Ha", "big,</w>": "big</w>", "th,r": "thr", "fit,.</w>": "fit.</w>", "tr,y</w>": "try</w>", "0,</w>": "0</w>", "e,very</w>": "every</w>", "ou,s</w>": "ous</w>", "sneak,er": "sneaker", "d,ur": "dur", "A,</w>": "A</w>", "l,ess</w>": "less</w>", "B,ut</w>": "But</w>", "la,st": "last", "tt,ing</w>": "tting</w>", "lo,ves</w>": "loves</w>", "tt,y</w>": "tty</w>", "styli,sh</w>": "stylish</w>", "I\u2019,m</w>": "I\u2019m</w>", "go,ing</w>": "going</w>", "happ,y</w>": "happy</w>", "in,to</w>": "into</w>", "10,</w>": "10</w>", "Com,fortab": "Comfortab", "the,ir</w>": "their</w>", "sneak,er</w>": "sneaker</w>", "t,wo</w>": "two</w>", "ch,ers</w>": "chers</w>", "o,c": "oc", ".,5": ".5", "com,f": "comf", "m,in": "min", "ne,ver</w>": "never</w>", "n,i": "ni", "i,d</w>": "id</w>", "an,ce</w>": "ance</w>", "narr,ow": "narrow", "H,o": "Ho", "y,e": "ye", "wear,.</w>": "wear.</w>", "is,su": "issu", "feel,s</w>": "feels</w>", "t,ing</w>": "ting</w>", "pp,o": "ppo", "ti,ve</w>": "tive</w>", "k,,</w>": "k,</w>", "o,ver": "over", "oo,l</w>": "ool</w>", "pre,tty</w>": "pretty</w>", "Zappo,s</w>": "Zappos</w>", "t,y</w>": "ty</w>", "prob,le": "proble", "tong,ue</w>": "tongue</w>", "lar,</w>": "lar</w>", "t,s.</w>": "ts.</w>", "m,ely</w>": "mely</w>", "da,y.</w>": "day.</w>", "wh,ere</w>": "where</w>", "t,en": "ten", "the,se.</w>": "these.</w>", "the,y're</w>": "they're</w>", "m,s</w>": "ms</w>", "revie,w": "review", "h,ard</w>": "hard</w>", "it,.</w>": "it.</w>", "..,.": "...", "be,ing</w>": "being</w>", "rec,ei": "recei", "con,d</w>": "cond</w>", "gh,t.</w>": "ght.</w>", "h,el": "hel", "th,at": "that", "wh,o</w>": "who</w>", "month,s</w>": "months</w>", "p,e</w>": "pe</w>", "wom,en": "women", "sa,ppo": "sappo", "sappo,in": "sappoin", "u,sed</w>": "used</w>", "tre,mely</w>": "tremely</w>", "l,in": "lin", "soc,ks</w>": "socks</w>", "c,i": "ci", "l,es</w>": "les</w>", "s,!</w>": "s!</w>", "An,d</w>": "And</w>", "wid,th": "width", "st,a": "sta", "1/,2</w>": "1/2</w>", "d,uc": "duc", "well,.</w>": "well.</w>", "a,v": "av", "ru,b": "rub", "u,t": "ut", "m,m": "mm", "p,u": "pu", "com,e</w>": "come</w>", "to,p</w>": "top</w>", "foo,t.</w>": "foot.</w>", "per,i": "peri", "I,t": "It", "com,fort": "comfort", "T,</w>": "T</w>", "b,le</w>": "ble</w>", "se,e</w>": "see</w>", "p,ri": "pri", "8,</w>": "8</w>", "a,maz": "amaz", "di,dn't</w>": "didn't</w>", "c,la": "cla", "perfec,tl": "perfectl", "thin,k</w>": "think</w>", "sin,ce</w>": "since</w>", "m,any</w>": "many</w>", "m,.</w>": "m.</w>", "bo,th</w>": "both</w>", "me,di": "medi", "fit,s</w>": "fits</w>", "b,est</w>": "best</w>", "or,t</w>": "ort</w>", "f,i": "fi", "c,lo": "clo", "ic,k": "ick", "ti,ght</w>": "tight</w>", "tri,ed</w>": "tried</w>", "N,e": "Ne", "wid,er</w>": "wider</w>", "ab,ly</w>": "ably</w>", "The,y're</w>": "They're</w>", "di,sappoin": "disappoin", "at,ely</w>": "ately</w>", "f,ac": "fac", "p,l": "pl", "v,en": "ven", "be,for": "befor", "su,ally</w>": "sually</w>", "p,le</w>": "ple</w>", "on,,</w>": "on,</w>", "su,re</w>": "sure</w>", "al,most</w>": "almost</w>", "L,i": "Li", "da,ys</w>": "days</w>", "f,ar</w>": "far</w>", "larg,er</w>": "larger</w>", "se,cond</w>": "second</w>", "tic,</w>": "tic</w>", "P,er": "Per", "c,re": "cre", "w,ar": "war", "cu,st": "cust", "7,</w>": "7</w>", "u,g": "ug", "4,</w>": "4</w>", "pec,i": "peci", "&,</w>": "&</w>", "9,</w>": "9</w>", "O,n": "On", "styli,sh": "stylish", "norm,ally</w>": "normally</w>", "es,n": "esn", "ell,ent</w>": "ellent</w>", "f,ound</w>": "found</w>", "ch,ang": "chang", "st,an": "stan", "o,le</w>": "ole</w>", "fort,un": "fortun", "1,2</w>": "12</w>", "sm,all</w>": "small</w>", "fec,t</w>": "fect</w>", "materi,al</w>": "material</w>", "pair,.</w>": "pair.</w>", "re,plac": "replac", "whi,le</w>": "while</w>", "the,n</w>": "then</w>", "ca,me</w>": "came</w>", "brea,k</w>": "break</w>", "c,</w>": "c</w>", "ti,m": "tim", "br,an": "bran", "every,day</w>": "everyday</w>", "i,ly</w>": "ily</w>", "ac,tu": "actu", "re,d</w>": "red</w>", "de,finitely</w>": "definitely</w>", "comp,li": "compli", "compli,men": "complimen", "11,</w>": "11</w>", "fu,l</w>": "ful</w>", "j,o": "jo", "ver,si": "versi", "6,</w>": "6</w>", "pp,er</w>": "pper</w>", "hi,m</w>": "him</w>", "h,ea": "hea", "shoes,!</w>": "shoes!</w>", "F,it</w>": "Fit</w>", "materi,al": "material", ";,</w>": ";</w>", "it,s</w>": "its</w>", "foo,t": "foot", "l,ot</w>": "lot</w>", "wan,ted</w>": "wanted</w>", "p,s</w>": "ps</w>", "bu,ying</w>": "buying</w>", "N,ice</w>": "Nice</w>", "ic,e.</w>": "ice.</w>", "u,m": "um", "d,es</w>": "des</w>", "sa,y</w>": "say</w>", "E,x": "Ex", "gh,ly</w>": "ghly</w>", "ab,le.</w>": "able.</w>", "do,esn": "doesn", "V,ans</w>": "Vans</w>", "c,ou": "cou", "thr,ough</w>": "through</w>", "U,n": "Un", "s,e,</w>": "se,</w>", "w,e</w>": "we</w>", "pro,vi": "provi", "th,er.</w>": "ther.</w>", "ke,ep</w>": "keep</w>", "?,</w>": "?</w>", "gh,t,</w>": "ght,</w>", "D,</w>": "D</w>", "p,-": "p-", "sh,ould</w>": "should</w>", "d,ow": "dow", "v,or": "vor", "j,e": "je", "rea,dy</w>": "ready</w>", "ex,tremely</w>": "extremely</w>", "Su,per</w>": "Super</w>", "pa,d": "pad", "k,s.</w>": "ks.</w>", "see,m</w>": "seem</w>", "ea,si": "easi", "er,,</w>": "er,</w>", "li,ght": "light", "w,on": "won", "Comfortab,le</w>": "Comfortable</w>", "st,ru": "stru", "v,e": "ve", "desig,n</w>": "design</w>", "b,er</w>": "ber</w>", "m,ar": "mar", "wan,t</w>": "want</w>", "k,now</w>": "know</w>", "cushi,on": "cushion", "or,tho": "ortho", "P,ro": "Pro", "wei,ght</w>": "weight</w>", "th,ough</w>": "though</w>", "g,r": "gr", "norm,al</w>": "normal</w>", "pro,duc": "produc", "n,ow": "now", "u,sually</w>": "usually</w>", "tion,.</w>": "tion.</w>", "small,er</w>": "smaller</w>", "A,s</w>": "As</w>", "Per,fect</w>": "Perfect</w>", "t,in": "tin", "befor,e</w>": "before</w>", "Y,</w>": "Y</w>", "di,s": "dis", "oul,dn't</w>": "ouldn't</w>"}, "vocab": {"<PAD>": 0, "<UNK>": 1, "B": 2, "o": 3, "u": 4, "g": 5, "h": 6, "t": 7, "</w>": 8, "e": 9, "s": 10, "f": 11, "r": 12, "m": 13, "y": 14, "n": 15, "a": 16, "d": 17, "L": 18, "O": 19, "V": 20, "E": 21, "S": 22, "!": 23, "H": 24, "w": 25, "l": 26, "v": 27, "I": 28, "i": 29, "b": 30, "p": 31, "C": 32, ".": 33, "c": 34, "D": 35, "'": 36, "P": 37, "A": 38, "z": 39, "T": 40, "k": 41, "W": 42, ",": 43, "1": 44, "j": 45, "q": 46, "\u2026": 47, "-": 48, "&": 49, "Z": 50, "\u2019": 51, "J": 52, "x": 53, "G": 54, "5": 55, "0": 56, "(": 57, ")": 58, ":": 59, "F": 60, "8": 61, "+": 62, "\"": 63, "M": 64, "N": 65, "R": 66, "9": 67, "\u2018": 68, "/": 69, "2": 70, "?": 71, ";": 72, "\u201c": 73, "\u201d": 74, "3": 75, "4": 76, "Y": 77, "6": 78, "\u00c2": 79, "\u00bd": 80, "U": 81, "K": 82, "=": 83, "\\": 84, "7": 85, "\u00e1": 86, "$": 87, "X": 88, "%": 89, "#": 90, "*": 91, "Q": 92, "~": 93, "]": 94, "\u2014": 95, ">": 96, "\u00b9": 97, "[": 98, "`": 99, "\u2013": 100, "e</w>": 101, "th": 102, "t</w>": 103, "s</w>": 104, "d</w>": 105, ".</w>": 106, "y</w>": 107, "er": 108, "an": 109, "in": 110, "or": 111, "ar": 112, "o</w>": 113, "the</w>": 114, "and</w>": 115, "I</w>": 116, "the": 117, "sh": 118, "on": 119, "al": 120, ",</w>": 121, "ou": 122, "re": 123, "for": 124, "a</w>": 125, "sho": 126, "om": 127, "ing": 128, "en": 129, "er</w>": 130, "to</w>": 131, "ing</w>": 132, "es</w>": 133, "is</w>": 134, "ed</w>": 135, "f</w>": 136, "se</w>": 137, "Th": 138, "ha": 139, "oo": 140, "ve</w>": 141, "wi": 142, "st": 143, "li": 144, "ab": 145, "l</w>": 146, "le</w>": 147, "ly</w>": 148, "com": 149, "at</w>": 150, "si": 151, "m</w>": 152, "e.</w>": 153, "we": 154, "of</w>": 155, "for</w>": 156, "gh": 157, "in</w>": 158, "fe": 159, "are</w>": 160, "as</w>": 161, "ti": 162, "bu": 163, "it</w>": 164, "k</w>": 165, "es": 166, "on</w>": 167, "fort": 168, "ver": 169, "it": 170, "my</w>": 171, "ch": 172, "th</w>": 173, "su": 174, "shoes</w>": 175, "they</w>": 176, "ir": 177, "fortab": 178, "at": 179, "ow": 180, "ea": 181, "comfortab": 182, "these</w>": 183, "st</w>": 184, "ac": 185, "but</w>": 186, "an</w>": 187, "The": 188, "have</w>": 189, "!</w>": 190, "siz": 191, "ic": 192, "pp": 193, "ot</w>": 194, "wear": 195, "ol": 196, "pa": 197, "with</w>": 198, "them</w>": 199, "loo": 200, "be": 201, "en</w>": 202, "ll</w>": 203, "shoe</w>": 204, "fee": 205, "to": 206, "n</w>": 207, "ur": 208, "that</w>": 209, "so</w>": 210, "The</w>": 211, "e,</w>": 212, "p</w>": 213, "wh": 214, "ke</w>": 215, "s.</w>": 216, "ght</w>": 217, "di": 218, "was</w>": 219, "very</w>": 220, "gre": 221, "pair": 222, "ri": 223, "comfortable</w>": 224, "t.</w>": 225, "lo": 226, "size</w>": 227, "ally</w>": 228, "you": 229, "al</w>": 230, "de</w>": 231, "not</w>": 232, "or</w>": 233, "ch</w>": 234, "tt": 235, "se": 236, "ne": 237, "oul": 238, "ere</w>": 239, "out</w>": 240, "wor": 241, "ro": 242, "this</w>": 243, "me</w>": 244, "ca": 245, "wear</w>": 246, "da": 247, "ma": 248, "be</w>": 249, "fit</w>": 250, "like</w>": 251, "ther</w>": 252, "ow</w>": 253, "ex": 254, "ru": 255, "shoes": 256, "so": 257, "per": 258, "de": 259, "'t</w>": 260, "They</w>": 261, "ould</w>": 262, "I'": 263, "le": 264, "king</w>": 265, "sty": 266, "d.</w>": 267, "all</w>": 268, "pair</w>": 269, "y.</w>": 270, "sa": 271, "qu": 272, "lac": 273, "la": 274, "These</w>": 275, "men": 276, "great</w>": 277, "mo": 278, "bo": 279, "le.</w>": 280, "'s</w>": 281, "el": 282, "sn": 283, "un": 284, "fec": 285, "ge": 286, "you</w>": 287, "ood</w>": 288, "der": 289, "ks</w>": 290, "ust</w>": 291, "ore</w>": 292, "wal": 293, "too</w>": 294, "wa": 295, "than</w>": 296, "om</w>": 297, "look</w>": 298, "ong": 299, "were</w>": 300, "ff": 301, "them": 302, "tr": 303, "con": 304, "supp": 305, "hi": 306, "w</w>": 307, "gh</w>": 308, "eak": 309, "use</w>": 310, "pe": 311, "foo": 312, "fr": 313, "ear": 314, "ely</w>": 315, "all": 316, "ver</w>": 317, "ent</w>": 318, "cu": 319, "suppor": 320, "rea": 321, "other</w>": 322, "s,</w>": 323, "had</w>": 324, "fin": 325, "col": 326, "sli": 327, "perfec": 328, "just</w>": 329, "sed</w>": 330, "more</w>": 331, "shoes.</w>": 332, "feet</w>": 333, "would</w>": 334, "vi": 335, "one</w>": 336, "ought</w>": 337, "love</w>": 338, "sneak": 339, "ice</w>": 340, "re</w>": 341, "oun": 342, "..": 343, "ers</w>": 344, "ery</w>": 345, "wid": 346, "good</w>": 347, "lea": 348, "som": 349, "t,</w>": 350, "pro": 351, "ke": 352, "ter</w>": 353, "sol": 354, "wide</w>": 355, "shoe.</w>": 356, "lar": 357, "up</w>": 358, "Very</w>": 359, "get</w>": 360, "ce</w>": 361, "5</w>": 362, "Gre": 363, "from</w>": 364, "tur": 365, "y,</w>": 366, "Great</w>": 367, "ing.</w>": 368, "fit": 369, "day</w>": 370, "le,</w>": 371, "order": 372, "arr": 373, "sm": 374, "will</w>": 375, "ag": 376, "whi": 377, "comfortable.</w>": 378, "alit": 379, "I'm</w>": 380, "ho": 381, "2</w>": 382, "ts</w>": 383, "them.</w>": 384, "ig": 385, "ys</w>": 386, "most</w>": 387, "My</w>": 388, "er.</w>": 389, "us": 390, "really</w>": 391, "can</w>": 392, "cause</w>": 393, "narr": 394, "year": 395, "qualit": 396, "ough</w>": 397, "This</w>": 398, "ds</w>": 399, "r</w>": 400, "pre": 401, "great": 402, "ted</w>": 403, "feel</w>": 404, "mi": 405, "sti": 406, "am</w>": 407, "comp": 408, "ut</w>": 409, "cha": 410, "has</w>": 411, "pur": 412, "he": 413, "looking</w>": 414, "sh</w>": 415, "long": 416, "fter</w>": 417, "ta": 418, "when</w>": 419, "10": 420, "if</w>": 421, "do": 422, "fir": 423, "litt": 424, "about</w>": 425, "mu": 426, "because</w>": 427, "ue</w>": 428, "per</w>": 429, "own</w>": 430, "app": 431, "don": 432, "ite</w>": 433, "pr": 434, "ound</w>": 435, "little</w>": 436, "sole</w>": 437, "bought</w>": 438, "ll": 439, "purcha": 440, "tion": 441, "d,</w>": 442, "te": 443, "es.</w>": 444, "I've</w>": 445, "ordered</w>": 446, "tly</w>": 447, "no</w>": 448, "sual</w>": 449, "big": 450, "br": 451, "wearing</w>": 452, "commen": 453, "been</w>": 454, "fu": 455, "pec": 456, "me": 457, "der</w>": 458, "fa": 459, ")</w>": 460, "ded</w>": 461, "retur": 462, "style</w>": 463, "any</w>": 464, ".5</w>": 465, "Lo": 466, "foot</w>": 467, "able</w>": 468, "which</w>": 469, "-</w>": 470, "box": 471, "tic": 472, "ev": 473, "'re</w>": 474, "dn": 475, "well</w>": 476, "ater": 477, "some</w>": 478, "tion</w>": 479, "thing</w>": 480, "do</w>": 481, "he</w>": 482, "po": 483, "mon": 484, "ever": 485, "bac": 486, "lt</w>": 487, "support</w>": 488, "arch</w>": 489, "shi": 490, "first</w>": 491, "ra": 492, "rec": 493, "go": 494, "k.</w>": 495, "ding</w>": 496, "recommen": 497, "ked</w>": 498, "ess</w>": 499, "now</w>": 500, "after</w>": 501, "ved</w>": 502, "op": 503, "diff": 504, "sy</w>": 505, "ep": 506, "tru": 507, "casual</w>": 508, "larg": 509, "color": 510, "bit</w>": 511, "narrow</w>": 512, "quality</w>": 513, "se.</w>": 514, "only</w>": 515, "ate</w>": 516, "toe</w>": 517, "your</w>": 518, "right</w>": 519, "time</w>": 520, "Love</w>": 521, "slip</w>": 522, "got</w>": 523, "brea": 524, "don't</w>": 525, "hal": 526, "ff</w>": 527, "go</w>": 528, "He</w>": 529, "styli": 530, "It</w>": 531, "par": 532, "no": 533, "el</w>": 534, "wha": 535, "every": 536, "bett": 537, "orm": 538, "ad": 539, "buy</w>": 540, "much</w>": 541, "11": 542, "still</w>": 543, "off": 544, "soc": 545, "sk": 546, "y're</w>": 547, "small": 548, "work</w>": 549, "worn</w>": 550, "uc": 551, "way</w>": 552, "usb": 553, "est</w>": 554, "walking</w>": 555, "I\u2019": 556, "!!</w>": 557, "long</w>": 558, "half</w>": 559, "ar</w>": 560, "perfect</w>": 561, "\u2019t</w>": 562, "size.</w>": 563, "nice</w>": 564, "norm": 565, "ard</w>": 566, "even</w>": 567, "ans</w>": 568, "me.</w>": 569, "feel": 570, "back</w>": 571, "ic</w>": 572, "true</w>": 573, "differ": 574, "gi": 575, "ei": 576, "ateri": 577, "wan": 578, "comfortable,</w>": 579, "husb": 580, "color</w>": 581, "see": 582, "what</w>": 583, "blac": 584, "\"</w>": 585, "put</w>": 586, "dn't</w>": 587, "sig": 588, "also</w>": 589, "\u2019s</w>": 590, "leather</w>": 591, "ying</w>": 592, "great.</w>": 593, "around</w>": 594, "kes</w>": 595, "Com": 596, "another</w>": 597, "tri": 598, "fort</w>": 599, "old</w>": 600, "materi": 601, "appo": 602, "happ": 603, "im": 604, "can": 605, "in.</w>": 606, "with": 607, "ell": 608, "tu": 609, "how</w>": 610, "and": 611, "ther": 612, "Zappo": 613, "ves</w>": 614, "super</w>": 615, "felt</w>": 616, "lu": 617, "ter": 618, "well": 619, "side</w>": 620, "new</w>": 621, "ft</w>": 622, "3</w>": 623, "ned</w>": 624, "exc": 625, "shoes,</w>": 626, "on.</w>": 627, "too": 628, "ssi": 629, "ss</w>": 630, "te</w>": 631, "ever</w>": 632, "wee": 633, "soles</w>": 634, "sneakers</w>": 635, "his</w>": 636, "ang": 637, "sin": 638, "feet.</w>": 639, "ser": 640, "shoe,</w>": 641, "easy</w>": 642, "is": 643, "pairs</w>": 644, "ght": 645, "better</w>": 646, "recommend</w>": 647, "any": 648, "made</w>": 649, "different</w>": 650, "comfort</w>": 651, "same</w>": 652, "gu": 653, "i</w>": 654, "aga": 655, "husband</w>": 656, "box</w>": 657, "prob": 658, "month": 659, "wom": 660, "expec": 661, "ir</w>": 662, "tre": 663, "walk</w>": 664, "vie": 665, "E</w>": 666, "il": 667, "tho": 668, "desig": 669, "ways</w>": 670, "width</w>": 671, "run</w>": 672, "hou": 673, "laces</w>": 674, "nee": 675, "up": 676, "by</w>": 677, "dy</w>": 678, "order</w>": 679, "it's</w>": 680, "last</w>": 681, "ty": 682, "So</w>": 683, "S</w>": 684, "black</w>": 685, "need</w>": 686, "n.</w>": 687, "ba": 688, "out": 689, "could</w>": 690, "some": 691, "pic": 692, "high</w>": 693, "revie": 694, "wei": 695, "sp": 696, "end</w>": 697, "down</w>": 698, "light</w>": 699, "find</w>": 700, "ep</w>": 701, "there</w>": 702, "looks</w>": 703, "Re": 704, "over</w>": 705, "heel</w>": 706, "Ske": 707, "dre": 708, "ving</w>": 709, "If</w>": 710, "Wi": 711, "tl": 712, "star": 713, ").</w>": 714, "make</w>": 715, "tong": 716, "cushi": 717, "goo": 718, "wore</w>": 719, "enough</w>": 720, "son</w>": 721, "es,</w>": 722, "1/": 723, "off</w>": 724, "purchased</w>": 725, "ank": 726, "wo</w>": 727, "thin": 728, "plac": 729, "without</w>": 730, "return</w>": 731, "ough": 732, "Su": 733, "run": 734, "ing,</w>": 735, "did</w>": 736, "always</w>": 737, "Al": 738, "Sho": 739, "sur": 740, "finit": 741, "finitely</w>": 742, "...</w>": 743, "walk": 744, "few</w>": 745, "years</w>": 746, "support.</w>": 747, "shoe": 748, "fl": 749, "ning</w>": 750, "An": 751, "maz": 752, "ed.</w>": 753, "Good</w>": 754, "Not</w>": 755, "white</w>": 756, "Ha": 757, "big</w>": 758, "thr": 759, "fit.</w>": 760, "try</w>": 761, "0</w>": 762, "every</w>": 763, "ous</w>": 764, "sneaker": 765, "dur": 766, "A</w>": 767, "less</w>": 768, "But</w>": 769, "last": 770, "tting</w>": 771, "loves</w>": 772, "tty</w>": 773, "stylish</w>": 774, "I\u2019m</w>": 775, "going</w>": 776, "happy</w>": 777, "into</w>": 778, "10</w>": 779, "Comfortab": 780, "their</w>": 781, "sneaker</w>": 782, "two</w>": 783, "chers</w>": 784, "oc": 785, ".5": 786, "comf": 787, "min": 788, "never</w>": 789, "ni": 790, "id</w>": 791, "ance</w>": 792, "narrow": 793, "Ho": 794, "ye": 795, "wear.</w>": 796, "issu": 797, "feels</w>": 798, "ting</w>": 799, "ppo": 800, "tive</w>": 801, "k,</w>": 802, "over": 803, "ool</w>": 804, "pretty</w>": 805, "Zappos</w>": 806, "ty</w>": 807, "proble": 808, "tongue</w>": 809, "lar</w>": 810, "ts.</w>": 811, "mely</w>": 812, "day.</w>": 813, "where</w>": 814, "ten": 815, "these.</w>": 816, "they're</w>": 817, "ms</w>": 818, "review": 819, "hard</w>": 820, "it.</w>": 821, "...": 822, "being</w>": 823, "recei": 824, "cond</w>": 825, "ght.</w>": 826, "hel": 827, "that": 828, "who</w>": 829, "months</w>": 830, "pe</w>": 831, "women": 832, "sappo": 833, "sappoin": 834, "used</w>": 835, "tremely</w>": 836, "lin": 837, "socks</w>": 838, "ci": 839, "les</w>": 840, "s!</w>": 841, "And</w>": 842, "width": 843, "sta": 844, "1/2</w>": 845, "duc": 846, "well.</w>": 847, "av": 848, "rub": 849, "ut": 850, "mm": 851, "pu": 852, "come</w>": 853, "top</w>": 854, "foot.</w>": 855, "peri": 856, "It": 857, "comfort": 858, "T</w>": 859, "ble</w>": 860, "see</w>": 861, "pri": 862, "8</w>": 863, "amaz": 864, "didn't</w>": 865, "cla": 866, "perfectl": 867, "think</w>": 868, "since</w>": 869, "many</w>": 870, "m.</w>": 871, "both</w>": 872, "medi": 873, "fits</w>": 874, "best</w>": 875, "ort</w>": 876, "fi": 877, "clo": 878, "ick": 879, "tight</w>": 880, "tried</w>": 881, "Ne": 882, "wider</w>": 883, "ably</w>": 884, "They're</w>": 885, "disappoin": 886, "ately</w>": 887, "fac": 888, "pl": 889, "ven": 890, "befor": 891, "sually</w>": 892, "ple</w>": 893, "on,</w>": 894, "sure</w>": 895, "almost</w>": 896, "Li": 897, "days</w>": 898, "far</w>": 899, "larger</w>": 900, "second</w>": 901, "tic</w>": 902, "Per": 903, "cre": 904, "war": 905, "cust": 906, "7</w>": 907, "ug": 908, "4</w>": 909, "peci": 910, "&</w>": 911, "9</w>": 912, "On": 913, "stylish": 914, "normally</w>": 915, "esn": 916, "ellent</w>": 917, "found</w>": 918, "chang": 919, "stan": 920, "ole</w>": 921, "fortun": 922, "12</w>": 923, "small</w>": 924, "fect</w>": 925, "material</w>": 926, "pair.</w>": 927, "replac": 928, "while</w>": 929, "then</w>": 930, "came</w>": 931, "break</w>": 932, "c</w>": 933, "tim": 934, "bran": 935, "everyday</w>": 936, "ily</w>": 937, "actu": 938, "red</w>": 939, "definitely</w>": 940, "compli": 941, "complimen": 942, "11</w>": 943, "ful</w>": 944, "jo": 945, "versi": 946, "6</w>": 947, "pper</w>": 948, "him</w>": 949, "hea": 950, "shoes!</w>": 951, "Fit</w>": 952, "material": 953, ";</w>": 954, "its</w>": 955, "foot": 956, "lot</w>": 957, "wanted</w>": 958, "ps</w>": 959, "buying</w>": 960, "Nice</w>": 961, "ice.</w>": 962, "um": 963, "des</w>": 964, "say</w>": 965, "Ex": 966, "ghly</w>": 967, "able.</w>": 968, "doesn": 969, "Vans</w>": 970, "cou": 971, "through</w>": 972, "Un": 973, "se,</w>": 974, "we</w>": 975, "provi": 976, "ther.</w>": 977, "keep</w>": 978, "?</w>": 979, "ght,</w>": 980, "D</w>": 981, "p-": 982, "should</w>": 983, "dow": 984, "vor": 985, "je": 986, "ready</w>": 987, "extremely</w>": 988, "Super</w>": 989, "pad": 990, "ks.</w>": 991, "seem</w>": 992, "easi": 993, "er,</w>": 994, "light": 995, "won": 996, "Comfortable</w>": 997, "stru": 998, "ve": 999, "design</w>": 1000, "ber</w>": 1001, "mar": 1002, "want</w>": 1003, "know</w>": 1004, "cushion": 1005, "ortho": 1006, "Pro": 1007, "weight</w>": 1008, "though</w>": 1009, "gr": 1010, "normal</w>": 1011, "produc": 1012, "now": 1013, "usually</w>": 1014, "tion.</w>": 1015, "smaller</w>": 1016, "As</w>": 1017, "Perfect</w>": 1018, "tin": 1019, "before</w>": 1020, "Y</w>": 1021, "dis": 1022, "ouldn't</w>": 1023}}